#include "GameRule.h"
#include "MyGameMain.h"

//-----------------------------------------------------------------------------
//リソース処理
//-----------------------------------------------------------------------------
void GameRule::InitializeResource()
{
	DG::Image_Create("GamesetsumeiImg", "./data/image/Gamesetsumei.png");			//ゲームルール
}
//-----------------------------------------------------------------------------
//初期化処理
//機能概要：プログラム起動時に１回実行される（素材などの準備を行う）
//-----------------------------------------------------------------------------
bool GameRule::Initialize()
{
	if (!Scene::Initialize())
		return false;
	return true;
}
//-----------------------------------------------------------------------------
//更新処理
//機能概要：ゲームの１フレームに当たる処理
//-----------------------------------------------------------------------------
void GameRule::Update()
{
	mouse = DI::Mouse_GetState();


	if (mouse.LB.down) {
		currentScene = scenes["Game"];
		currentScene->Initialize();
	}
}
//-----------------------------------------------------------------------------
//描画処理
//機能概要：ゲームの１フレームに当たる表示処理
//-----------------------------------------------------------------------------
void GameRule::Render()
{
	ML::Box2D draw(0, 0, 960, 544);
	ML::Box2D src(0, 0, 960, 544);
	DG::Image_Draw("GamesetsumeiImg", draw, src);
}
//-----------------------------------------------------------------------------
//解放処理
//機能概要：プログラム終了時に１回実行される（素材などの解放を行う）
//-----------------------------------------------------------------------------
void GameRule::Finalize()
{
	DG::Image_Erase("GamesetsumeiImg");
}
