#include"GameOver.h"
#include "MyGameMain.h"

//-----------------------------------------------------------------------------
//リソース処理
//-----------------------------------------------------------------------------
void GameOver::InitializeResource()
{
	DG::Image_Create("GameoverImg", "./data/image/Gameover.png");					//ゲームオーバー
	DG::Image_Create("haikei_blackImg", "./data/image/haikei_black.png");			//背景
}
//-----------------------------------------------------------------------------
//初期化処理
//機能概要：プログラム起動時に１回実行される（素材などの準備を行う）
//-----------------------------------------------------------------------------
bool GameOver::Initialize()
{
	if (!Scene::Initialize()) {
		return false;
	}

	return true;
}
//-----------------------------------------------------------------------------
//更新処理
//機能概要：ゲームの１フレームに当たる処理
//-----------------------------------------------------------------------------
void GameOver::Update()
{
	//マウスカーソルの位置を得る
	mouse = DI::Mouse_GetState();

	if (mouse.LB.down) {
		currentScene = scenes["Title"];
		currentScene->Initialize();
	}
}
//-----------------------------------------------------------------------------
//描画処理
//機能概要：ゲームの１フレームに当たる表示処理
//-----------------------------------------------------------------------------
void GameOver::Render()
{
	//背景の表示
	haikei_Render(haikei);
	//ゲームオーバーの表示
	overstage_Render(overstage);
}
//-----------------------------------------------------------------------------
//解放処理
//機能概要：プログラム終了時に１回実行される（素材などの解放を行う）
//-----------------------------------------------------------------------------
void GameOver::Finalize()
{
	DG::Image_Erase("GameoverImg");
	DG::Image_Erase("haikei_blackImg");
}
//--------------------------------------------------------------------------------------------------------------------------------
//関数
//--------------------------------------------------------------------------------------------------------------------------------
//ゲームオーバーの表示
void GameOver::overstage_Render(Object& ob_)
{
	ML::Box2D draw(0, 0, 960, 544);
	ML::Box2D src(0, 0, 960, 544);
	DG::Image_Draw("GameoverImg", draw, src);
}
//--------------------------------------------------------------------------------------------------------------------------------
//背景の表示
void GameOver::haikei_Render(Object& ob_)
{
	ML::Box2D draw(0, 0, 960, 544);
	ML::Box2D src(0, 0, 960, 544);
	DG::Image_Draw("haikei_blackImg", draw, src);
}