#include"MyGameMain.h"
#include"GameClear.h"

//-----------------------------------------------------------------------------
//リソース処理
//-----------------------------------------------------------------------------
void GameClear::InitializeResource()
{
	DG::Image_Create("GameclearImg", "./data/image/Gameclear.png");					//ゲームクリア
	DG::Image_Create("haikei_blackImg", "./data/image/haikei_black.png");			//背景
}
//-----------------------------------------------------------------------------
//初期化処理
//機能概要：プログラム起動時に１回実行される（素材などの準備を行う）
//-----------------------------------------------------------------------------
bool GameClear::Initialize()
{
	if (!Scene::Initialize()) {
		return false;
	}
	return true;
}
//-----------------------------------------------------------------------------
//更新処理
//機能概要：ゲームの１フレームに当たる処理
//-----------------------------------------------------------------------------
void GameClear::Update()
{
	//マウスカーソルの位置を得る
	mouse = DI::Mouse_GetState();

	if (mouse.LB.down) {
		currentScene = scenes["Title"];
		currentScene->Initialize();
	}
}
//-----------------------------------------------------------------------------
//描画処理
//機能概要：ゲームの１フレームに当たる表示処理
//-----------------------------------------------------------------------------
void GameClear::Render()
{
	//背景の表示
	haikei_Render(haikei);
	//ゲームクリアの表示
	gameclear_Render(gameclear);
}
//-----------------------------------------------------------------------------
//解放処理
//機能概要：プログラム終了時に１回実行される（素材などの解放を行う）
//-----------------------------------------------------------------------------
void GameClear::Finalize()
{
	DG::Image_Erase("GameclearImg");
	DG::Image_Erase("haikei_blackImg");
}
//--------------------------------------------------------------------------------------------------------------------------------
//関数
//--------------------------------------------------------------------------------------------------------------------------------
//ゲームクリアの表示
void GameClear::gameclear_Render(Object& ob_) 
{
	ML::Box2D draw(0, 0, 960, 544);
	ML::Box2D src(0, 0, 960, 544);
	DG::Image_Draw("GameclearImg", draw, src);
}
//背景の表示のプロトタイプ宣言
void GameClear::haikei_Render(Object& ob_) 
{
	ML::Box2D draw(0, 0, 960, 544);
	ML::Box2D src(0, 0, 960, 544);
	DG::Image_Draw("haikei_blackImg", draw, src);
}
