#include "MyPG.h"
#include "MyGameMain.h"

//ゲームクリア
namespace Gameclear
{
	//ゲーム情報
	DI::Mouse mouse;

	//構造体型定義
	struct Object {
		bool active;			//生存判断
	};
	Object gameclear;
	Object haikei;

	//------------------------------------------------------------------------------
	//関数のプロトタイプ宣言
	//------------------------------------------------------------------------------
	//ゲームクリアの表示のプロトタイプ宣言
	void gameclear_Render(Object& ob_);
	//背景の表示のプロトタイプ宣言
	void haikei_Render(Object& ob_);

	//-----------------------------------------------------------------------------
	//初期化処理
	//機能概要：プログラム起動時に１回実行される（素材などの準備を行う）
	//-----------------------------------------------------------------------------
	void Initialize()
	{
		DG::Image_Create("GameclearImg", "./data/image/Gameclear.png");					//ゲームクリア
		DG::Image_Create("haikei_blackImg", "./data/image/haikei_black.png");			//背景

	}
	//-----------------------------------------------------------------------------
	//解放処理
	//機能概要：プログラム終了時に１回実行される（素材などの解放を行う）
	//-----------------------------------------------------------------------------
	void Finalize()
	{
		DG::Image_Erase("GameclearImg");
		DG::Image_Erase("haikei_blackImg");
	}
	//-----------------------------------------------------------------------------
	//更新処理
	//機能概要：ゲームの１フレームに当たる処理
	//-----------------------------------------------------------------------------
	TaskFlag UpDate()
	{
		mouse = DI::Mouse_GetState();


		TaskFlag rtv = Task_Gameclear;
		if (mouse.LB.down) {
			rtv = Task_Title;	//次のタスクをタイトルへ
		}
		return rtv;
	}
	//-----------------------------------------------------------------------------
	//描画処理
	//機能概要：ゲームの１フレームに当たる表示処理
	//-----------------------------------------------------------------------------
	void Render()
	{
		//背景の表示
		haikei_Render(haikei);
		//ゲームクリアの表示
		gameclear_Render(gameclear);
	}
	//--------------------------------------------------------------------------------------------------------------------------------
	//関数
	//--------------------------------------------------------------------------------------------------------------------------------
	//ゲームクリアの表示
	void gameclear_Render(Object& ob_)
	{
		ML::Box2D draw(0, 0, 960, 544);
		ML::Box2D src(0, 0, 960, 544);
		DG::Image_Draw("GameclearImg", draw, src);
	}
	//--------------------------------------------------------------------------------------------------------------------------------
	//背景の表示
	void haikei_Render(Object& ob_)
	{
		ML::Box2D draw(0, 0, 960, 544);
		ML::Box2D src(0, 0, 960, 544);
		DG::Image_Draw("haikei_blackImg", draw, src);
	}
}