#include "MyPG.h"
#include "MyGameMain.h"

//ゲーム説明
namespace Gamesetsumei
{
	//ゲーム情報
	DI::Mouse mouse;

	//構造体型定義
	struct Object {
		bool active;			//生存判断
	};
	Object haikei;

	//------------------------------------------------------------------------------
	//関数のプロトタイプ宣言
	//------------------------------------------------------------------------------
	//背景の表示のプロトタイプ宣言
	void haikei_Render(Object& ob_);

	//-----------------------------------------------------------------------------
	//初期化処理
	//機能概要：プログラム起動時に１回実行される（素材などの準備を行う）
	//-----------------------------------------------------------------------------
	void Initialize()
	{
		DG::Image_Create("GamesetsumeiImg", "./data/image/Gamesetsumei.png");			//背景

	}
	//-----------------------------------------------------------------------------
	//解放処理
	//機能概要：プログラム終了時に１回実行される（素材などの解放を行う）
	//-----------------------------------------------------------------------------
	void Finalize()
	{
		DG::Image_Erase("GamesetsumeiImg");
	}
	//-----------------------------------------------------------------------------
	//更新処理
	//機能概要：ゲームの１フレームに当たる処理
	//-----------------------------------------------------------------------------
	TaskFlag UpDate()
	{
		mouse = DI::Mouse_GetState();


		TaskFlag rtv = Task_Gamesetsumei;
		if (mouse.LB.down) {
			rtv = Task_Game;	//次のタスクをゲームタイトル画面へ
		}
		return rtv;
	}
	//-----------------------------------------------------------------------------
	//描画処理
	//機能概要：ゲームの１フレームに当たる表示処理
	//-----------------------------------------------------------------------------
	void Render()
	{
		//背景の表示
		haikei_Render(haikei);
	}
	//--------------------------------------------------------------------------------------------------------------------------------
	//関数
	//--------------------------------------------------------------------------------------------------------------------------------
	//背景の表示
	void haikei_Render(Object& ob_)
	{
		ML::Box2D draw(0, 0, 960, 544);
		ML::Box2D src(0, 0, 960, 544);
		DG::Image_Draw("GamesetsumeiImg", draw, src);
	}
}