#include "MyPG.h"
#include "MyGameMain.h"

//ゲームオーバー
namespace Gameover
{
	//ゲーム情報
	DI::Mouse mouse;

	//構造体型定義
	struct Object{
		bool active;			//生存判断
	};
	Object overstage;
	Object haikei;

	//------------------------------------------------------------------------------
	//関数のプロトタイプ宣言
	//------------------------------------------------------------------------------
	//ゲームオーバーの表示のプロトタイプ宣言
	void overstage_Render(Object& ob_);
	//背景の表示のプロトタイプ宣言
	void haikei_Render(Object& ob_);

	//-----------------------------------------------------------------------------
	//初期化処理
	//機能概要：プログラム起動時に１回実行される（素材などの準備を行う）
	//-----------------------------------------------------------------------------
	void Initialize()
	{
		DG::Image_Create("GameoverImg", "./data/image/Gameover.png");					//ゲームオーバー
		DG::Image_Create("haikei_blackImg", "./data/image/haikei_black.png");			//背景

	}
	//-----------------------------------------------------------------------------
	//解放処理
	//機能概要：プログラム終了時に１回実行される（素材などの解放を行う）
	//-----------------------------------------------------------------------------
	void Finalize()
	{
		DG::Image_Erase("GameoverImg");
		DG::Image_Erase("haikei_blackImg");
	}
	//-----------------------------------------------------------------------------
	//更新処理
	//機能概要：ゲームの１フレームに当たる処理
	//-----------------------------------------------------------------------------
	TaskFlag UpDate()
	{
		mouse = DI::Mouse_GetState();


		TaskFlag rtv = Task_Gameover;
		if (mouse.LB.down) {
			rtv = Task_Title;	//次のタスクをゲームタイトル画面へ
		}
		return rtv;
	}
	//-----------------------------------------------------------------------------
	//描画処理
	//機能概要：ゲームの１フレームに当たる表示処理
	//-----------------------------------------------------------------------------
	void Render()
	{
		//背景の表示
		haikei_Render(haikei);
		//ゲームオーバーの表示
		overstage_Render(overstage);
	}
	//--------------------------------------------------------------------------------------------------------------------------------
	//関数
	//--------------------------------------------------------------------------------------------------------------------------------
	//ゲームオーバーの表示
	void overstage_Render(Object& ob_)
	{
		ML::Box2D draw(0, 0, 960, 544);
		ML::Box2D src(0, 0, 960, 544);
		DG::Image_Draw("GameoverImg", draw, src);
	}
	//--------------------------------------------------------------------------------------------------------------------------------
	//背景の表示
	void haikei_Render(Object& ob_)
	{
		ML::Box2D draw(0, 0, 960, 544);
		ML::Box2D src(0, 0, 960, 544);
		DG::Image_Draw("haikei_blackImg", draw, src);
	}
}